#+Title: Dynamics and Information
#+Author: Britt Anderson
#+Date: Winter 2022
#+bibliography:/home/britt/gitRepos/masterBib/bayatt.bib
#+csl-style: ../admin/cambridge-university-press-numeric.csl
#+options: ^:nil toc:nil d:nil

**** Some Algebra

#+Name: solving-for-t
#+header: :headers '("\\usepackage{amsmath}")
#+header: :exports results
#+options: tex:t
#+begin_src latex :results raw
    \begin{align*}
      \frac{dx}{dt} &= \sin{x} \\
      \frac{dx}{\sin{x}} &= dt\\
      \int{\csc{x} dx} &= \int{dt}\\
      -\ln{|\csc{x} + \cot{x}|}+C &= t\\
      \ln{\left| \frac{\csc{x_0} + \cot{x_0}}{\csc{x} + \cot{x}}\right|} &= t\\
  \end{align*}
#+end_src

#+RESULTS:
\begin{align*}
    \frac{dx}{dt} &= \sin{x} \\
    \frac{dx}{\sin{x}} &= dt\\
    \int{\csc{x} dx} &= \int{dt}\\
    -\ln{|\csc{x} + \cot{x}|}+C &= t\\
    \ln{\left| \frac{\csc{x_0} + \cot{x_0}}{\csc{x} + \cot{x}}\right|} &= t\\
\end{align*}

